bscopix/Ble_Mesh_Kp/STM32_WPAN/App/app_ble.c
#endif /* P2P_SERVER2 != 0 */

#if (P2P_SERVER3 != 0)
static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '3'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01,                               /*SKD version */
                           CFG_DEV_ID_P2P_SERVER3,             /* STM32WB - P2P Server 3*/
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00,                               /* BLE MAC stop */
                          };
#endif /* P2P_SERVER3 != 0 */

#if (P2P_SERVER4 != 0)
static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '4'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01,                               /*SKD version */
                           CFG_DEV_ID_P2P_SERVER4,             /* STM32WB - P2P Server 4*/
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00,                               /* BLE MAC stop */
                          };
#endif /* P2P_SERVER4 != 0 */

#if (P2P_SERVER5 != 0)
static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '5'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01,                               /*SKD version */
                           CFG_DEV_ID_P2P_SERVER5,             /* STM32WB - P2P Server 5*/
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00,                               /* BLE MAC stop */
                          };
#endif /* P2P_SERVER5 != 0 */

#if (P2P_SERVER6 != 0)
static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '6'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01,                               /*SKD version */
                           CFG_DEV_ID_P2P_SERVER6,             /* STM32WB - P2P Server 6*/
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00,                               /* BLE MAC stop */
                          };
#endif /* P2P_SERVER6 != 0 */

/* USER CODE BEGIN PV */
static uint16_t LastHandledDisconnectHandle = 0xFFFFU;
static uint32_t LastHandledDisconnectTick = 0U;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx(void *p_Payload);
static void BLE_StatusNot(HCI_TL_CmdStatus_t Status);
static void Ble_Tl_Init(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static void Adv_Request(APP_BLE_ConnStatus_t NewStatus);
static void Adv_Cancel(void);
static void Adv_Cancel_Req(void);
static void Switch_OFF_GPIO(void);
static uint8_t APP_BLE_ShouldForwardMeshEvents(void);
static uint8_t APP_BLE_IsMeshOwningAdvertising(void);
static void APP_BLE_HandleDisconnectEvent(uint16_t connection_handle, uint8_t reason, uint8_t source_svcctl);
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle);
static void Connection_Interval_Update_Req(void);
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/* USER CODE BEGIN PFP */
void additionnal_adv_Cancel(void);
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  SHCI_CmdStatus_t status;
  uint8_t boot_opcode;
  uint8_t provision_result;
  uint8_t provisioning_boot_requested;
  uint32_t reset_flags;
#if (RADIO_ACTIVITY_EVENT != 0)
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
#endif /* RADIO_ACTIVITY_EVENT != 0 */
  /* USER CODE BEGIN APP_BLE_Init_1 */
	a_LocalName[0]=AD_TYPE_COMPLETE_LOCAL_NAME;
	
	// Calculer la longueur r�elle de la cha�ne SSID
  size_t ssid_length = my_strnlen(Eeprom_name_Config.SSID, SIZE_OF_SSID);
  // Copiez le SSID en vous assurant qu'il se termine par '\0'
  strncpy(&a_LocalName[1], Eeprom_name_Config.SSID, ssid_length);
	
	// Calculer la longueur r�elle de la cha�ne SSID + pr�fixe
  a_LocalName_length = ssid_length+1; // +1 pour le pr�fixe

  boot_opcode = GetNfcBootOpcode();
  if (boot_opcode != NFC_BOOT_OPCODE_NONE)
  {
    APP_DBG_MSG("==>> NFC boot opcode detected: 0x%02x\n", boot_opcode);

