bscopix/Ble_Mesh_Kp/STM32_WPAN/App/app_ble.c
    if (boot_opcode == NFC_BOOT_OPCODE_MESH_FACTORY_RESET)
    {
      ClearNfcBootOpcode();

      if (MOBLE_FAILED(Appli_MeshEraseProvisioningStorage()))
      {
        APP_DBG_MSG("==>> NFC boot rescue failed: mesh NVM erase error\n");
      }
      else
      {
        APP_DBG_MSG("==>> NFC boot rescue: mesh provisioning storage erased\n");
      }

      ClearProvisioningBootRequest(PROVISION_RESULT_UNKNOWN);
    }
    else
    {
      APP_DBG_MSG("==>> NFC boot opcode unknown, clearing\n");
      ClearNfcBootOpcode();
    }
  }

  provision_result = GetProvisioningResult();
  provisioning_boot_requested = (uint8_t)(IsProvisioningBootRequested() ? 1U : 0U);
  reset_flags = RCC->CSR;
  APP_DBG_MSG("==>> Reset flags: CSR=0x%08x PIN=%u POR=%u SFT=%u IWDG=%u WWDG=%u LPWR=%u\n",
              reset_flags,
              (reset_flags & RCC_CSR_PINRSTF) ? 1U : 0U,
              (reset_flags & RCC_CSR_BORRSTF) ? 1U : 0U,
              (reset_flags & RCC_CSR_SFTRSTF) ? 1U : 0U,
              (reset_flags & RCC_CSR_IWDGRSTF) ? 1U : 0U,
              (reset_flags & RCC_CSR_WWDGRSTF) ? 1U : 0U,
              (reset_flags & RCC_CSR_LPWRRSTF) ? 1U : 0U);
  __HAL_RCC_CLEAR_RESET_FLAGS();
  APP_DBG_MSG("==>> Boot provisioning state: %s (result=%u boot_req=%u)\n",
              (provision_result == PROVISION_RESULT_SUCCESS) ? "PROVISIONED" : "UNPROVISIONED_OR_UNKNOWN",
              provision_result,
              provisioning_boot_requested);
  /* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
     0,                                 /** BleBufferSize not used */
     CFG_BLE_NUM_GATT_ATTRIBUTES,
     CFG_BLE_NUM_GATT_SERVICES,
     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
     CFG_BLE_NUM_LINK,
     CFG_BLE_DATA_LENGTH_EXTENSION,
     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
     CFG_BLE_MBLOCK_COUNT,
     CFG_BLE_MAX_ATT_MTU,
     CFG_BLE_PERIPHERAL_SCA,
     CFG_BLE_CENTRAL_SCA,
     CFG_BLE_LS_SOURCE,
     CFG_BLE_MAX_CONN_EVENT_LENGTH,
     CFG_BLE_HSE_STARTUP_TIME,
     CFG_BLE_VITERBI_MODE,
     CFG_BLE_OPTIONS,
     0,
     CFG_BLE_MAX_COC_INITIATOR_NBR,
     CFG_BLE_MIN_TX_POWER,
     CFG_BLE_MAX_TX_POWER,
     CFG_BLE_RX_MODEL_CONFIG,
     CFG_BLE_MAX_ADV_SET_NBR,
     CFG_BLE_MAX_ADV_DATA_LEN,
     CFG_BLE_TX_PATH_COMPENS,
     CFG_BLE_RX_PATH_COMPENS,
     CFG_BLE_CORE_VERSION,
     CFG_BLE_OPTIONS_EXT
    }
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init();

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
  if (status != SHCI_Success)
  {
    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
    /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
    Error_Handler();
  }
  else
  {
    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
  }

  /**
   * Initialization of HCI & GATT & GAP layer
   */
#ifdef DISABLE_MESH_AUTOSTART
  Ble_Hci_Gap_Gatt_Init();
  APP_DBG_MSG("==>> Mesh autostart disabled: legacy Ble_Hci_Gap_Gatt_Init enabled\n");
#else
  {
    uint8_t bd_addr[CONFIG_DATA_PUBADDR_LEN];
    tBleStatus ret_addr = BLE_STATUS_INVALID_PARAMS;

    /* Utilise la même adresse que le firmware GATT : dérivée du UDN via GetMacAdd()
     * (BuildMacAdd = 0xC000<<32 + LL_FLASH_GetUDN), identique dans les deux firmwares */
    {
      uint64_t mac = GetMacAdd();
      bd_addr[0] = (uint8_t)(mac & 0xFFULL);
      bd_addr[1] = (uint8_t)((mac >> 8)  & 0xFFULL);
      bd_addr[2] = (uint8_t)((mac >> 16) & 0xFFULL);
      bd_addr[3] = (uint8_t)((mac >> 24) & 0xFFULL);
      bd_addr[4] = (uint8_t)((mac >> 32) & 0xFFULL);
      bd_addr[5] = (uint8_t)((mac >> 40) & 0xFFULL);
    }

    ret_addr = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                       CONFIG_DATA_PUBADDR_LEN,
                                         bd_addr);
    if (ret_addr != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET, result: 0x%x\n", ret_addr);
    }
    else
    {
      APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET\n");
      APP_DBG_MSG("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",
                  bd_addr[5],
                  bd_addr[4],
                  bd_addr[3],
                  bd_addr[2],
                  bd_addr[1],
                  bd_addr[0]);
    }
  }
  APP_DBG_MSG("==>> Mesh autostart enabled: skip legacy Ble_Hci_Gap_Gatt_Init\n");
#endif

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

  /**
   * From here, all initialization are BLE application specific
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_ADV_CANCEL_ID, UTIL_SEQ_RFU, Adv_Cancel);
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
  UTIL_SEQ_RegTask(1<<CFG_TASK_CONN_UPDATE_REG_ID, UTIL_SEQ_RFU, Connection_Interval_Update_Req);
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

  /**
   * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
   */
#if (BLE_CFG_OTA_REBOOT_CHAR != 0)
  a_ManufData[sizeof(a_ManufData)-8] = CFG_FEATURE_OTA_REBOOT;
#endif /* BLE_CFG_OTA_REBOOT_CHAR != 0 */

#if (RADIO_ACTIVITY_EVENT != 0)
  ret = aci_hal_set_radio_activity_mask(0x0006);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
#endif /* RADIO_ACTIVITY_EVENT != 0 */

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
  index_con_int = 0;
  mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */
  DISAPP_Init();

	BASAPP_Init(0);
  /**
   * Initialize P2P Server Application
   */
  P2PS_APP_Init();

