bscopix/Ble_Mesh_Kp/STM32_WPAN/App/app_ble.c
  /* USER CODE BEGIN APP_BLE_Init_3 */
	//UTIL_SEQ_RegTask( 1<< CFG_TASK_SHOT_ADV_ID, UTIL_SEQ_RFU, update_adv_shot_data );
	UTIL_SEQ_RegTask( 1<< CFG_TASK_SHOT_ADV_ID, UTIL_SEQ_RFU, additionnal_adv );
	UTIL_SEQ_RegTask(1<<CFG_TASK_SHOT_ADV_CANCEL_ID, UTIL_SEQ_RFU, additionnal_adv_Cancel);
	/**
   * Create timer to handle the Shot Advertising Stop
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_additionnal_timer_Id), hw_ts_SingleShot, additionnal_adv_Cancel);
  /* USER CODE END APP_BLE_Init_3 */

  /**
   * Create timer to handle the Advertising Stop
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Cancel_Req);
  /**
   * Create timer to handle the Led Switch OFF
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);

  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;

  /* Initialize intervals for reconnexion without intervals update */
  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

  /**
   * Start legacy advertising only when Mesh autostart is disabled.
   * With Mesh autostart enabled, provisioning shall run in Mesh-only mode
   * (same principle as BLE_MeshLightingPRFNode).
   */
#ifdef DISABLE_MESH_AUTOSTART
  {
    const uint8_t mesh_owns_advertising = APP_BLE_IsMeshOwningAdvertising();

    if (mesh_owns_advertising == 0U)
  {
    Adv_Request(APP_BLE_FAST_ADV);

    if (BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV)
    {
      /* Start additional beacon only after primary discoverable advertising is active. */
      additionnal_adv();
    }
    else
    {
      APP_DBG_MSG("==>> Legacy primary advertising did not start at boot, skip additional beacon\n");
    }
  }
  else
  {
      APP_DBG_MSG("==>> Mesh owns advertising: legacy GAP advertising disabled\n");
    }
  }
  /* USER CODE BEGIN APP_BLE_Init_2 */
#else
  APP_DBG_MSG("==>> Mesh autostart enabled: legacy GAP advertising/beacon disabled\n");
#endif

  /* USER CODE END APP_BLE_Init_2 */

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  hci_event_pckt    *p_event_pckt;
  uint8_t           event_code;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;
  uint8_t           Tx_phy, Rx_phy;
  tBleStatus        ret = BLE_STATUS_INVALID_PARAMS;
  hci_le_connection_complete_event_rp0        *p_connection_complete_event;
  hci_disconnection_complete_event_rp0        *p_disconnection_complete_event;
  uint16_t          disconnection_handle = 0U;
  uint8_t           disconnection_reason = 0U;
  uint8_t           disconnection_captured = 0U;
  hci_le_phy_update_complete_event_rp0        *p_evt_le_phy_update_complete;
#if (CFG_DEBUG_APP_TRACE != 0)
  hci_le_connection_update_complete_event_rp0 *p_connection_update_complete_event;
#endif /* CFG_DEBUG_APP_TRACE != 0 */

  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;
  event_code = p_event_pckt->evt;

  if (event_code == HCI_DISCONNECTION_COMPLETE_EVT_CODE)
  {
    APP_DBG_MSG("[APP][DISC_EVT] SVCCTL_App_Notification reached\n");
  }

  if (event_code == HCI_DISCONNECTION_COMPLETE_EVT_CODE)
  {
    p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;
    disconnection_handle = p_disconnection_complete_event->Connection_Handle;
    disconnection_reason = p_disconnection_complete_event->Reason;
    disconnection_captured = 1U;
  }

  /* In legacy unprovisioned mode, keep behavior close to reference (no mesh callback side effects). */
#ifndef DISABLE_MESH_AUTOSTART
  HCI_Event_CB(p_Pckt);
#if (LOW_POWER_FEATURE == 1)
  UTIL_SEQ_SetTask(1 << CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);
#endif
#else
  if (APP_BLE_ShouldForwardMeshEvents() != 0U)
  {
    HCI_Event_CB(p_Pckt);
#if (LOW_POWER_FEATURE == 1)
    UTIL_SEQ_SetTask(1 << CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);
#endif
  }
#endif

  switch (event_code)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      if (disconnection_captured != 0U)
      {
        APP_BLE_HandleDisconnectEvent(disconnection_handle,
                                      disconnection_reason,
                                      0U);
      }

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
#if (CFG_DEBUG_APP_TRACE != 0)
          p_connection_update_complete_event = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                       p_connection_update_complete_event->Conn_Interval*1.25,
                       p_connection_update_complete_event->Conn_Latency,
                       p_connection_update_complete_event->Supervision_Timeout*10);
#endif /* CFG_DEBUG_APP_TRACE != 0 */

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
          p_evt_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          APP_DBG_MSG("==>> HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE - ");
          if (p_evt_le_phy_update_complete->Status == 0)
          {
            APP_DBG_MSG("status ok \n");
          }
          else
          {
            APP_DBG_MSG("status nok \n");
          }

          ret = hci_le_read_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, &Tx_phy, &Rx_phy);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> hci_le_read_phy : fail\n\r");
          }
          else
          {
            APP_DBG_MSG("==>> hci_le_read_phy - Success \n");

