bscopix/Ble_Mesh_Kp/STM32_WPAN/App/app_ble.c
            APP_DBG_MSG(">>== ATTR_DATA[0]=0x%02x\r\n", p_attr->Attr_Data[0]);

            /* During runtime provisioning, Network/Proxy Config PDUs indicate
             * configuration traffic is still ongoing: refresh the runtime deadline
             * but do not mark configuration as completed. */
            if (IsProvisioningRuntimeSessionActive() &&
                (BLEMesh_IsUnprovisioned() == MOBLE_FALSE) &&
                ((proxy_type == 0x00U) || (proxy_type == 0x02U)))
            {
              StartProvisioningRuntimeSession(GetProvisioningTimeoutSeconds());
            }
          }
        }
        break;

        /* USER CODE BEGIN BLUE_EVT */

        /* USER CODE END BLUE_EVT */
        default:
          if (IsProvisioningRuntimeSessionActive())
          {
            APP_DBG_MSG(">>== VSEVT unhandled ecode: 0x%04x\r\n", p_blecore_evt->ecode);
          }
          break;
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return BleApplicationContext.Device_Connection_Status;
}

void APP_BLE_NotifyDisconnection(uint16_t connection_handle, uint8_t reason)
{
  APP_BLE_HandleDisconnectEvent(connection_handle, reason, 1U);
}

static void APP_BLE_HandleDisconnectEvent(uint16_t connection_handle, uint8_t reason, uint8_t source_svcctl)
{
  const uint32_t now = HAL_GetTick();

  if ((LastHandledDisconnectHandle == connection_handle) &&
      ((uint32_t)(now - LastHandledDisconnectTick) < 100U))
  {
    APP_DBG_MSG("==>> Duplicate disconnect event ignored (handle=0x%x src=%u)\n",
                connection_handle,
                source_svcctl);
    return;
  }

  LastHandledDisconnectHandle = connection_handle;
  LastHandledDisconnectTick = now;

  if ((BleApplicationContext.BleApplicationContext_legacy.connectionHandle != 0U) &&
      (connection_handle != BleApplicationContext.BleApplicationContext_legacy.connectionHandle))
  {
    APP_DBG_MSG(">>== Disconnect handle mismatch: evt=0x%x ctx=0x%x\n",
                connection_handle,
                BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  }

  /* Always release connection context on disconnect to keep restart path deterministic. */
  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

  APP_DBG_MSG(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE (src=%u)\n", source_svcctl);
  APP_DBG_MSG("     - Connection Handle:   0x%x\n     - Reason:    0x%x\n\r",
              connection_handle,
              reason);
  APP_DBG_MSG("     - Uptime: %u ms\n", HAL_GetTick());

#ifdef DISABLE_MESH_AUTOSTART
  {
    const uint8_t runtime_active = (uint8_t)(IsProvisioningRuntimeSessionActive() ? 1U : 0U);
    const uint8_t provision_result = GetProvisioningResult();
    const uint8_t mesh_owns_advertising = APP_BLE_IsMeshOwningAdvertising();

    APP_DBG_MSG("==>> Disconnect path: runtime=%u result=%u status=%u\n",
                runtime_active,
                provision_result,
                (unsigned int)BleApplicationContext.Device_Connection_Status);

    if (mesh_owns_advertising == 0U)
    {
      Adv_Request(APP_BLE_FAST_ADV);

      if (BleApplicationContext.Device_Connection_Status != APP_BLE_FAST_ADV)
      {
        APP_DBG_MSG("==>> Legacy advertising restart failed, retry once\n");
        Adv_Request(APP_BLE_FAST_ADV);
      }

      if (BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV)
      {
        /* Keep post-disconnect discoverability consistent with boot behavior. */
        additionnal_adv();
      }
      else
      {
        APP_DBG_MSG("==>> Legacy advertising still not active after retry\n");
      }
    }
    else
    {
      APP_DBG_MSG("==>> Skip legacy advertising restart: Mesh owns advertising\n");
    }
  }
#endif

  /* SPECIFIC to P2P Server APP */
  HandleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
  HandleNotification.ConnectionHandle = connection_handle;
  P2PS_APP_Notification(&HandleNotification);
}

static uint8_t APP_BLE_IsMeshOwningAdvertising(void)
{
  const uint8_t runtime_active = (uint8_t)(IsProvisioningRuntimeSessionActive() ? 1U : 0U);
  const uint8_t provision_result = GetProvisioningResult();

  if (runtime_active != 0U)
  {
    return 1U;
  }

  if (provision_result == PROVISION_RESULT_SUCCESS)
  {
    if (BLEMesh_IsUnprovisioned() != MOBLE_FALSE)
    {
      APP_DBG_MSG("==>> Provisioning state mismatch: persisted success, mesh reports unprovisioned (keeping mesh ownership)\n");
    }

    /* Persisted provisioned state keeps mesh ownership; do not auto-clear or reset. */
    return 1U;
  }

  return 0U;
}

static uint8_t APP_BLE_ShouldForwardMeshEvents(void)
{
  if (IsProvisioningRuntimeSessionActive())
  {
    return 1U;
  }

  if (GetProvisioningResult() == PROVISION_RESULT_SUCCESS)
  {
    return 1U;
  }

  return 0U;
}

/* USER CODE BEGIN FD*/

/* USER CODE END FD*/

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init(void)
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  uint32_t a_srd_bd_addr[2] = {0,0};
  uint16_t a_appearance[1] = {BLE_CFG_GAP_APPEARANCE};
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init*/

  //a_srd_bd_addr[0] = LL_FLASH_GetUDN();
  //a_srd_bd_addr[1] = 0xC000; /* The two upper bits shall be set to 1 */

