bscopix/Ble_Mesh_Kp/STM32_WPAN/App/app_ble.c
  if (NewStatus == APP_BLE_FAST_ADV)
  {
    Min_Inter = AdvIntervalMin;
    Max_Inter = AdvIntervalMax;
  }
  else
  {
    Min_Inter = CFG_LP_CONN_ADV_INTERVAL_MIN;
    Max_Inter = CFG_LP_CONN_ADV_INTERVAL_MAX;
  }

  /**
   * Stop the timer, it will be restarted for a new shot
   * It does not hurt if the timer was not running
   */
  HW_TS_Stop(BleApplicationContext.Advertising_mgr_timer_Id);

  if ((NewStatus == APP_BLE_LP_ADV)
      && ((BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV)
          || (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_ADV)))
  {
    /* Connection in ADVERTISE mode have to stop the current advertising */
    ret = aci_gap_set_non_discoverable();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_non_discoverable - Stop Advertising Failed , result: %d \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_non_discoverable - Successfully Stopped Advertising \n");
    }
  }

  /* Start Fast or Low Power Advertising */
  ret = aci_gap_set_discoverable(ADV_IND,
                                 Min_Inter,
                                 Max_Inter,
                                 CFG_BLE_ADDRESS_TYPE,
                                 NO_WHITE_LIST_USE, /* use white list */
                                 //sizeof(a_LocalName),
																 a_LocalName_length,
                                 (uint8_t*) &a_LocalName,
                                 BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen,
                                 BleApplicationContext.BleApplicationContext_legacy.advtServUUID,
                                 0,
                                 0);
  if (ret != BLE_STATUS_SUCCESS)
  {
    /* 0x0C/0x12 can happen when Mesh stack already controls advertising state. */
    if ((ret == 0x0CU) || (ret == 0x12U))
    {
      if (APP_BLE_IsMeshOwningAdvertising() != 0U)
      {
        APP_DBG_MSG("==>> aci_gap_set_discoverable - mesh already controls advertising (result: 0x%x)\n", ret);
        BleApplicationContext.Device_Connection_Status = NewStatus;
      }
      else
      {
        APP_DBG_MSG("==>> aci_gap_set_discoverable - unexpected conflict in legacy mode (result: 0x%x)\n", ret);
        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
      }
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_discoverable - fail, result: 0x%x \n", ret);
      BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
    }
    return;
  }
  else
  {
    BleApplicationContext.Device_Connection_Status = NewStatus;
    APP_DBG_MSG("==>> aci_gap_set_discoverable - Success\n");
  }

  /* Update Advertising data */
  ret = aci_gap_update_adv_data(sizeof(a_ManufData), (uint8_t*) a_ManufData);
  if (ret != BLE_STATUS_SUCCESS)
  {
    if (NewStatus == APP_BLE_FAST_ADV)
    {
      APP_DBG_MSG("==>> Start Fast Advertising Failed , result: %d \n\r", ret);
    }
    else
    {
      APP_DBG_MSG("==>> Start Low Power Advertising Failed , result: %d \n\r", ret);
    }
  }
  else
  {
    if (NewStatus == APP_BLE_FAST_ADV)
    {
      APP_DBG_MSG("==>> Success: Start Fast Advertising \n\r");
      /* Start Timer to STOP ADV - TIMEOUT - and next Restart Low Power Advertising */
      HW_TS_Start(BleApplicationContext.Advertising_mgr_timer_Id, INITIAL_ADV_TIMEOUT);
    }
    else
    {
      APP_DBG_MSG("==>> Success: Start Low Power Advertising \n\r");
    }
  }

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
#define CFG_ADD_ADV_INTERVAL_MIN          (0x30)   /**< 30ms */
#define CFG_ADD_ADV_INTERVAL_MAX          (0x40)  /**< 40ms */
#define ADV_CH_ALL 0x07 // Cette d�finition signifie que tous les canaux publicitaires (37, 38 et 39) sont utilis�s.

// Fonction pour mettre � jour la valeur de t�l�m�trie envoy�e
void update_adv_shot_data(void) {
	uint8_t initial_adv_shot_data = 0x78;
	
// D�finition des donn�es du beacon Eddystone TLM
/*uint8_t beacon_data[18] = {
    17,                          //< Length.
    AD_TYPE_SERVICE_DATA,        //< Service Data data type value.
    0xAA, 0xFE,                  //< 16-bit Eddystone UUID.
    0x20,                        //< TLM frame type.
    0x00,                        //< Version.
    0x00, 0x00,                  //< Battery Voltage (2 bytes).
    0x00, telemetry_data,                  //< Beacon Temperature (2 bytes).
    0x00, 0x00, 0x00, 0x00,      //< Advertising PDU count (4 bytes).
    0x00, 0x00, 0x00, 0x00,      //< Time since power-on or reboot (4 bytes).
};*/
/*uint8_t beacon_data[17] =
  {
    16 ,                                                //< Length. 
    AD_TYPE_SERVICE_DATA,                               //< Service Data data type value.
    0xAA, 0xFE,                                         //< 16-bit Eddystone UUID.
    0x10,                                               //< URL frame type.
    0x00,                                               //< Tx Power - Ranging data.
    CFG_TX_POWER,                                       //< URL Scheme Prefix is http://www.
    0x77,0x77,0x77,0x2E,0x73,0x74,0x2E,0x63,0x6F,0x6D,  //< www.st.com
   };*/
	 uint8_t beacon_data[] = {
    18 ,                                                //< Length. 
    AD_TYPE_SERVICE_DATA,                               //< Service Data data type value.
    0xAA, 0xFE,                                         //< 16-bit Eddystone UUID.
    0x30,                         // Frame Type (Eddystone-EID)
    CFG_TX_POWER,                         // TX Power
    P2P_Server_App_Context.ShotToNotification[0], 
		P2P_Server_App_Context.ShotToNotification[1],
		P2P_Server_App_Context.ShotToNotification[2],
		P2P_Server_App_Context.ShotToNotification[3],
		P2P_Server_App_Context.ShotToNotification[4],
		P2P_Server_App_Context.ShotToNotification[5],
		P2P_Server_App_Context.ShotToNotification[6],
		P2P_Server_App_Context.ShotToNotification[7],
		P2P_Server_App_Context.ShotToNotification[8],
		P2P_Server_App_Context.ShotToNotification[9],
		P2P_Server_App_Context.ShotToNotification[10],
		P2P_Server_App_Context.ShotToNotification[11],
		P2P_Server_App_Context.ShotToNotification[12]
};
    // Configurer les donn�es de la balise suppl�mentaire
    tBleStatus ret = aci_gap_additional_beacon_set_data(
        sizeof(beacon_data), // Taille des donn�es de la balise
        beacon_data          // Pointeur vers les donn�es de la balise
    );

    if (ret == BLE_STATUS_SUCCESS)
    {
       APP_DBG_MSG("CMD ==> Successfully ACI_GAP_ADDITIONNAL_BEACON_SET_DATA \r\n" );
    }
    else
    {
       APP_DBG_MSG("CMD ==> Failed ACI_GAP_ADDITIONNAL_BEACON_SET_DATA, result: %d \r\n", ret);
    }
}

void additionnal_adv(void)
{
/* tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

